pmo-dataset/variations/graphviz_basic/15.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Gather evidence" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Conduct self-assessment";
  "Issue official documents" -> "ExclusiveGateway_2";
  "ParallelGateway_2" -> "Conduct external audit";
  "ExclusiveGateway_2" -> "end";
  "ExclusiveGateway_1" -> "Award certification";
  "Identify gaps or issues" -> "Make necessary corrections or improvements";
  "Conduct external audit" -> "Identify gaps or issues";
  "Schedule compliance audit" -> "ParallelGateway_1";
  "Prepare documentation" -> "ParallelGateway_2";
  "Conduct self-assessment" -> "ParallelGateway_2";
  "Award certification" -> "Issue official documents";
  "start" -> "Schedule compliance audit";
  "Make necessary corrections or improvements" -> "Conduct final audit";
  "ParallelGateway_1" -> "Gather evidence";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Prepare documentation";
  "Conduct final audit" -> "ExclusiveGateway_1";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
